# ViewOrientation3D Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewOrientation3D Members
ViewOrientation3D Class Constructors Methods Properties See Also
---
The ViewOrientation3D type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ViewOrientation3D | Constructs a new ViewOrientation3D using the input eye position, up and forward directions. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ViewOrientation3D |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EyePosition | The eye position point |
| ForwardDirection | The forward direction vector |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| UpDirection | The up direction vector |

# See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace